zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/MC56F84565/codewarrior/MC56F84565_Vectors.c
/* User could redefine ivINT_PDB0.
Please be noted that ivINT_PDB0 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_PDB0 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_PDB0(void);
__attribute__((weak)) void ivINT_PDB0(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for QDC_INDEX_RO_RU **********************/

/* User could redefine ivINT_QDC_INDEX_RO_RU.
Please be noted that ivINT_QDC_INDEX_RO_RU can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_QDC_INDEX_RO_RU definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_QDC_INDEX_RO_RU(void);
__attribute__((weak)) void ivINT_QDC_INDEX_RO_RU(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for QDC_HOME_DOG **********************/

/* User could redefine ivINT_QDC_HOME_DOG.
Please be noted that ivINT_QDC_HOME_DOG can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_QDC_HOME_DOG definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_QDC_HOME_DOG(void);
__attribute__((weak)) void ivINT_QDC_HOME_DOG(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for QDC_COMPARE **********************/

/* User could redefine ivINT_QDC_COMPARE.
Please be noted that ivINT_QDC_COMPARE can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_QDC_COMPARE definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_QDC_COMPARE(void);
__attribute__((weak)) void ivINT_QDC_COMPARE(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for GPIOG **********************/

/* User could redefine ivINT_GPIOG.
Please be noted that ivINT_GPIOG can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_GPIOG definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_GPIOG(void);
__attribute__((weak)) void ivINT_GPIOG(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for GPIOF **********************/

/* User could redefine ivINT_GPIOF.
Please be noted that ivINT_GPIOF can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_GPIOF definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_GPIOF(void);
__attribute__((weak)) void ivINT_GPIOF(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for GPIOE **********************/

/* User could redefine ivINT_GPIOE.
Please be noted that ivINT_GPIOE can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_GPIOE definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_GPIOE(void);
__attribute__((weak)) void ivINT_GPIOE(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for GPIOD **********************/

/* User could redefine ivINT_GPIOD.
Please be noted that ivINT_GPIOD can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_GPIOD definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_GPIOD(void);
__attribute__((weak)) void ivINT_GPIOD(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for GPIOC **********************/

/* User could redefine ivINT_GPIOC.
Please be noted that ivINT_GPIOC can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_GPIOC definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_GPIOC(void);
__attribute__((weak)) void ivINT_GPIOC(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for GPIOB **********************/

/* User could redefine ivINT_GPIOB.
Please be noted that ivINT_GPIOB can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_GPIOB definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_GPIOB(void);
__attribute__((weak)) void ivINT_GPIOB(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for GPIOA **********************/

/* User could redefine ivINT_GPIOA.
Please be noted that ivINT_GPIOA can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_GPIOA definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_GPIOA(void);
__attribute__((weak)) void ivINT_GPIOA(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for COP_INT **********************/

/* User could redefine ivINT_COP_INT.
Please be noted that ivINT_COP_INT can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_COP_INT definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_COP_INT(void);
__attribute__((weak)) void ivINT_COP_INT(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for EWM_INT **********************/

/* User could redefine ivINT_EWM_INT.
Please be noted that ivINT_EWM_INT can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_EWM_INT definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_EWM_INT(void);
__attribute__((weak)) void ivINT_EWM_INT(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

